[
  {
    "title": "Tempo",
    "description": "A mobile app designed to help users manage their time and focus on what matters most through intentional task planning and distraction-free focus sessions.",
    "category": "Design",
    "slug": "tempo",
    "preview": "/src/assets/tempo-ui-home.png"
  },
  {
    "title": "Begig",
    "description": "A freelancing platform connecting clients with talented freelancers. Features include gig posting, proposal management, secure payments, and project tracking.",
    "category": "Development",
    "slug": "begig",
    "preview": "/src/assets/begig-client-dashboard.jpg"
  },
  {
    "title": "Woz",
    "description": "An AI-powered Wizard of Oz testing platform for conversational interfaces. Enables researchers to simulate AI responses and gather insights before building the actual system.",
    "category": "Research",
    "slug": "woz",
    "preview": "/src/assets/woz-overview.jpg"
  },
  {
    "title": "XUNO",
    "description": "A comprehensive design system and component library for building consistent, accessible web applications with modern UI patterns.",
    "category": "Design",
    "slug": "xuno",
    "preview": "/src/assets/xuno-hero.jpg"
  },
  {
    "title": "Dither-er",
    "description": "An interactive web tool for applying dithering effects to images. Experiment with various algorithms and export high-quality dithered artwork.",
    "category": "Tool",
    "slug": "dither-er",
    "preview": "/src/assets/dither-er-section-1.jpg"
  },
  {
    "title": "OOP Principles in Creative Coding",
    "description": "An academic paper exploring how object-oriented programming principles can be applied to creative coding practices and generative art.",
    "category": "Research",
    "slug": "oop-creative-coding",
    "preview": "/src/assets/confluence-thumbnail.svg"
  },
  {
    "title": "Amazeballs",
    "description": "An immersive maze game with innovative wearable controller integration. Navigate through procedurally generated mazes using custom hardware.",
    "category": "Development",
    "slug": "amazeballs",
    "preview": "/src/assets/amazeballs-main-menu.png"
  },
  {
    "title": "Confluence",
    "description": "A collaborative platform exploring the intersection of design and development workflows. Tools for seamless team communication and asset management.",
    "category": "Tool",
    "slug": "confluence",
    "preview": "/src/assets/confluence-thumbnail.svg"
  }
]
